Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/mem/r_sdc_sdmem_read.c
        r_sdc_sd_disable_icu_int(card_no);
        r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_CLEAR);
        R_SDHI_ClearSdstsReg(p_hndl->channel, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_CLEAR);
        r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_CLEAR);
        r_sdc_sd_enable_icu_int(card_no);
    }
    else
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR);
    }

    R_SDHI_SetClock(p_hndl->channel, 0, SDHI_CLOCK_DISABLE);

    return p_hndl->error;
} /* End of function r_sdc_sdmem_ReadSoftwareTransSingleCmd() */

/**********************************************************************************************************************
* Outline      : Read Block Data from SD Memory
* Function Name: r_sdc_sdmem_read_sect
* Description  : Reads block data from the SD Memory.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : sdc_sd_access_t  * p_sdc_sd_access     ;   SDHI Driver transfer configuration
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
static sdc_sd_status_t r_sdc_sdmem_read_sect(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    int32_t             j = 0;
    sdc_sd_status_t   ret = SDC_SD_SUCCESS;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ==== Check the status precede read operation. ==== */
    if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD13, SDC_SD_RESP_R1, p_hndl->rca[0]) == SDC_SD_SUCCESS)
    {
        if (SDC_SD_STATE_TRAN != (p_hndl->resp_status & SDC_SD_RES_STATE))  /* Not in transfer state */
        {
            p_hndl->error = SDC_SD_ERR;
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
            r_sdc_sdmem_read_write_error(card_no);
            return p_hndl->error;
        }
    }
    else    /* SDHI error */
    {
        if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD13, SDC_SD_RESP_R1, p_hndl->rca[0]) == SDC_SD_SUCCESS)
        {
            if (SDC_SD_STATE_TRAN != (p_hndl->resp_status & SDC_SD_RES_STATE))  /* Not in transfer state */
            {
                p_hndl->error = SDC_SD_ERR;
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
                r_sdc_sdmem_read_write_error(card_no);
                return p_hndl->error;
            }
        }
        else    /* SDHI error */
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
            r_sdc_sdmem_read_write_error(card_no);
            return p_hndl->error;
        }
    }

    /* Transfer size is fixed (SDC_SD_TRANS_BLOCK_SIZE bytes). */
    R_SDHI_OutReg(p_hndl->channel, SDHI_SDSIZE, SDC_SD_SECTOR_SIZE);

    /* In case of 1 or 2 blocks or Single Mode, execute the single read operation. */
    if ((2 >= p_sdc_sd_access->cnt) || (SDC_SD_MODE_SW_SINGLE == p_sdc_sd_access->mode))
    {
        /* ---- Clear SDBLKCNTEN in order to disable SDHI_SDBLKCNT. ---- */
        R_SDHI_OutReg(p_hndl->channel, SDHI_SDSTOP, SDHI_SDSTOP_INIT);

        /* WAIT_LOOP */
        for (j = p_sdc_sd_access->cnt; j > 0; j--, p_sdc_sd_access->lbn++,
             p_sdc_sd_access->p_buff = (p_sdc_sd_access->p_buff + SDC_SD_SECTOR_SIZE))
        {
            p_sdc_sd_access->cnt = 0x01;
            ret = r_sdc_sdmem_read_sect_sub(card_no, p_sdc_sd_access);
            if (SDC_SD_SUCCESS != ret)
            {
                break;
            }
        }
    }
    else
    {
        /* ---- Set SDBLKCNTEN in order to enable SDHI_SDBLKCNT. ---- */
        R_SDHI_OutReg(p_hndl->channel, SDHI_SDSTOP, SDHI_SDSTOP_SEC_ENABLE);
        R_SDHI_OutReg(p_hndl->channel, SDHI_SDBLKCNT, (uint32_t)p_sdc_sd_access->cnt);

        ret = r_sdc_sdmem_read_sect_sub(card_no, p_sdc_sd_access);
        if (SDC_SD_SUCCESS != ret)
        {
            return p_hndl->error;
        }
    }

    return p_hndl->error;
} /* End of function r_sdc_sdmem_read_sect() */

/**********************************************************************************************************************
* Outline      : Read Block Data from SD Memory (Sub-module)
* Function Name: r_sdc_sdmem_read_sect_sub
* Description  : Reads block data from the SD Memory using CMD17 or CMD18.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : sdc_sd_access_t  * p_sdc_sd_access     ;   SDHI Driver transfer configuration
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
static sdc_sd_status_t r_sdc_sdmem_read_sect_sub(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    sdc_sd_status_t ret = SDC_SD_SUCCESS;
    uint32_t        sdsts1_back = 0;
    uint32_t        set_acc_addr = 0;
    uint32_t        sdhi_sddma_ctrl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    if ((SDC_SD_MODE_DMA | SDC_SD_MODE_DTC) & p_sdc_sd_access->mode)
    {
        R_SDC_SD_SetDmacDtcTransFlg(card_no, SDC_SD_SET_TRANS_START);
        /* Enable the DMA/DTC. */
        R_SDHI_InReg(p_hndl->channel, SDHI_SDDMAEN, &sdhi_sddma_ctrl);
        sdhi_sddma_ctrl = (uint32_t)(sdhi_sddma_ctrl | SDHI_SDDMAEN_DMASDRW);
        R_SDHI_OutReg(p_hndl->channel, SDHI_SDDMAEN, sdhi_sddma_ctrl);
    }

    /* ---- Sets block address in case of SDHC/SDXC card. ---- */
    if (SDC_SD_CSD_STR_VER_2_0 <= p_hndl->csd_structure)
    {
        set_acc_addr = p_sdc_sd_access->lbn;
    }
    else
    {
        set_acc_addr = (p_sdc_sd_access->lbn * SDC_SD_TRANS_BLOCK_SIZE);
    }

    if (0x01 == p_sdc_sd_access->cnt)
    {
        /* Issue CMD17 (READ_SINGLE_BLOCK). */
        if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD17, SDC_SD_RESP_R1, set_acc_addr) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
            r_sdc_sdmem_read_write_error(card_no);
            return p_hndl->error;
        }
    }
    else
    {
        /* Issue CMD18 (READ_MULTIPLE_BLOCK). */
        if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD18, SDC_SD_RESP_R1, set_acc_addr) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
            r_sdc_sdmem_read_write_error(card_no);
            return p_hndl->error;
        }
    }

